РасширениеГТС/Джитиис/Documents/ЗаказНаПеремещение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказНаПеремещение</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Приоритеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ASP_ЗаказКлиента</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

РасширениеГТС/Джитиис/Documents/ЗаказНаПеремещение/Ext/ManagerModule.bsl
// Используется для получения данных из заказов на перемещение, используемых в обработке "Состояние обеспечения заказов".
// Аналогичные функции объявлены в модулях менеджеров всех типов заказов и учитывают структуру хранения данных документа.
//
// Возвращаемое значение:
// 		Строка - Текст запроса - Текст запроса для выборки данных.
//
Функция ТекстЗапросаЗаказовКОбеспечению() Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Т.Ссылка                  КАК Заказ,
	|	Т.КодСтроки               КАК КодСтроки,
	|	Т.НомерСтроки             КАК НомерСтроки,
	|	0                         КАК НомерСтрокиПродукция,
	|	НЕОПРЕДЕЛЕНО              КАК Продукция,
	|	НЕОПРЕДЕЛЕНО              КАК Этап,
	|	0                         КАК ЭтапПорядок,
	|	
	|	Т.Номенклатура            КАК Номенклатура,
	|	Т.Характеристика          КАК Характеристика,
	|	ТаблицаДокумента.СкладОтправитель КАК Склад,
	|	
	|	ВЫБОР КОГДА Т.Назначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|			И НЕ (ОбосабливатьПоНазначениюЗаказа
	|				И Т.Назначение.ТипНазначения = ЗНАЧЕНИЕ(Перечисление.ТипыНазначений.Собственное))
	|		ТОГДА Т.Назначение
	|		ИНАЧЕ ТаблицаДокумента.Назначение
	|	КОНЕЦ                     КАК Назначение,
	|	
	|	ТаблицаДокумента.Подразделение КАК Подразделение,
	|	
	|	Т.ВариантОбеспечения      КАК ВариантОбеспечения,
	|	Т.НачалоОтгрузки          КАК ДатаОтгрузки,
	|	Т.Упаковка                КАК Упаковка,
	|	
	|	Т.Количество              КАК Количество,
	|	
	|	ВЫБОР КОГДА ТаблицаДокумента.ЖелаемаяДатаПоступления <=&НачалоТекущегоДня ТОГДА
	|			&НачалоТекущегоДня
	|		КОГДА ДОБАВИТЬКДАТЕ(ТаблицаДокумента.ЖелаемаяДатаПоступления, ДЕНЬ, - ТаблицаДокумента.ДлительностьПеремещения) < &НачалоТекущегоДня ТОГДА
	|			&НачалоТекущегоДня
	|		ИНАЧЕ
	|			ДОБАВИТЬКДАТЕ(ТаблицаДокумента.ЖелаемаяДатаПоступления, ДЕНЬ, - ТаблицаДокумента.ДлительностьПеремещения)
	|	КОНЕЦ                                       КАК ЖелаемаяДатаОтгрузки,
	|	
	|	ЛОЖЬ                                        КАК НеОтгружатьЧастями,
	|	ТаблицаДокумента.Дата                       КАК Дата,
	|	НЕОПРЕДЕЛЕНО                                КАК Партнер,
	|	ТаблицаДокумента.Ответственный              КАК Менеджер,
	|	ТаблицаДокумента.Статус                     КАК Статус,
	|	&ИспользоватьСтатусыЗаказовНаПеремещение    КАК СтатусИспользуется
	|ИЗ
	|	Документ.ЗаказНаПеремещение.Товары КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаПеремещение КАК ТаблицаДокумента
	|		ПО Т.Ссылка = ТаблицаДокумента.Ссылка
	|
	|ГДЕ
	|	Т.Ссылка В (&Заказы)
	|	И ТаблицаДокумента.Проведен
	|	И Т.Отменено = ЛОЖЬ
	|	И ТаблицаДокумента.ПометкаУдаления = ЛОЖЬ
	|	И Т.ВариантОбеспечения В (
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.КОбеспечению),
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.УдалитьОбособленно),
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада),
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления)
	|	)";
	
	Возврат ТекстЗапроса;
	
КонецФункции
